# Importing Functions

## UBC MDS Extended Learning

### November 28

In [1]:
import numpy as np
import pandas as pd

## Functions

In [2]:
def log_function(happy_number):
    z = np.log(happy_number)
    print(f"The log of {happy_number} is {z}.")
    return z

log_five = log_function(5)

The log of 5 is 1.6094379124341003.

### Modularity
Functions allow complex processes to be broken up into smaller steps.
Imagine, for example, that you have a program that reads in a file, processes the file contents, and then writes an output file. Your code could look like this:

```
# Main program
# Code to read file in
<statement>
<statement>
<statement>
<statement>
# Code to process file
<statement>
<statement>
<statement>
<statement>
# Code to write file out
<statement>
<statement>
<statement>
<statement>
```

Alternatively, you could structure the code more like the following:

```
# Main program
read_file()
process_file()
write_file()
```

PS. Here, you do have three scripts where you have defined the functions.  For example:
```
def read_file():
# Code to read file in
<statement>
<statement>
<statement>
<statement>
```

### Function Calls and Definition 

A programming function is written as:

```
def <function_name>([<parameters>]):
    '''
    Docstrings
    '''
    <statement(s)>
    <return>
```

## Explaining for loops in groupby objects.

In [3]:
a_dict = {'employee_id': [1873, 4913, 4801, 4540, 3581,
                   4534, 1934, 4944, 1983, 1266], 
           'name': ['Josh', 'Laura', 'Hayley', 
                    'Mike', 'Tiffany', 'Anurag',
                    'Rocio', 'Eric', 'Monique',
                    'Emma'], 
            'neighbourhood': ['Sunset','West end','Kitsilano', 'Sunset', 
                              'Arbutus-ridge','Arbutus-ridge', 'Kitsilano', 
                              'West end','Kitsilano', 'Arbutus-ridge'],
            'type': ['full-time', 'part-time', 'part-time', 'full-time', 'part-time',
                     'full-time', 'full-time', 'part-time', 'part-time', 'full-time'],
            'hourly_rate': [25.0, 27.0, 30.0, 25.5, 32.0,
                         26.5, 27.0, 28.0, 25.5, 23.0]}

data = pd.DataFrame.from_dict(a_dict)
data

   employee_id     name  neighbourhood       type  hourly_rate
0         1873     Josh         Sunset  full-time         25.0
1         4913    Laura       West end  part-time         27.0
2         4801   Hayley      Kitsilano  part-time         30.0
3         4540     Mike         Sunset  full-time         25.5
4         3581  Tiffany  Arbutus-ridge  part-time         32.0
5         4534   Anurag  Arbutus-ridge  full-time         26.5
6         1934    Rocio      Kitsilano  full-time         27.0
7         4944     Eric       West end  part-time         28.0
8         1983  Monique      Kitsilano  part-time         25.5
9         1266     Emma  Arbutus-ridge  full-time         23.0

In [4]:
data.groupby('type').get_group('full-time')

   employee_id    name  neighbourhood       type  hourly_rate
0         1873    Josh         Sunset  full-time         25.0
3         4540    Mike         Sunset  full-time         25.5
5         4534  Anurag  Arbutus-ridge  full-time         26.5
6         1934   Rocio      Kitsilano  full-time         27.0
9         1266    Emma  Arbutus-ridge  full-time         23.0

In [5]:
grouped_df = data.groupby('type')

In [6]:
grouped_df

In [7]:
for group, rows in grouped_df:
    print(rows)

   employee_id    name  neighbourhood       type  hourly_rate
0         1873    Josh         Sunset  full-time         25.0
3         4540    Mike         Sunset  full-time         25.5
5         4534  Anurag  Arbutus-ridge  full-time         26.5
6         1934   Rocio      Kitsilano  full-time         27.0
9         1266    Emma  Arbutus-ridge  full-time         23.0
   employee_id     name  neighbourhood       type  hourly_rate
1         4913    Laura       West end  part-time         27.0
2         4801   Hayley      Kitsilano  part-time         30.0
4         3581  Tiffany  Arbutus-ridge  part-time         32.0
7         4944     Eric       West end  part-time         28.0
8         1983  Monique      Kitsilano  part-time         25.5

In [8]:
for group, rows in grouped_df:
    print(rows.sample(1))

   employee_id   name neighbourhood       type  hourly_rate
6         1934  Rocio     Kitsilano  full-time         27.0
   employee_id   name neighbourhood       type  hourly_rate
1         4913  Laura      West end  part-time         27.0

In [9]:
for group, rows in grouped_df:
    print(group)

full-time
part-time

In [10]:
for group, rows in grouped_df:
    print(print(group), rows.sample(1))

full-time
None    employee_id  name neighbourhood       type  hourly_rate
0         1873  Josh        Sunset  full-time         25.0
part-time
None    employee_id  name neighbourhood       type  hourly_rate
7         4944  Eric      West end  part-time         28.0